app/Models/BlogModel.php

SELECT *
FROM `blog`
---
    public function getAllBlog()
    {
        return $this->db->table('blog')->get()->getResultArray();