app/Models/ClientModel.php

    public function getAllClient()
    {
        return $this->db->table('client')->get()->getResultArray();
---
SELECT *
FROM `client`