app/Models/KontakModel.php

    public function getAllKontak()
    {
        return $this->db->table('kontak')->get()->getResultArray();
---
SELECT *
FROM `kontak`