app/Models/PelangganModel.php

    public function getAllPelanggan()
    {
        return $this->db->table('user')->get()->getResultArray();
---
SELECT *
FROM `user`