app/Models/ProdukModel.php

SELECT *
FROM `produk`
---
    public function getAllProduk()
    {
        return $this->db->table('produk')->get()->getResultArray();