app/Models/TestimoniModel.php

SELECT *
FROM `testimoni`
---
    public function getAllTestimoni()
    {
        return $this->db->table('testimoni')->get()->getResultArray();